app/controllers/items_controller.rb

  def new
    @item = Item.new
    @list = List.find(params[:list_id]) #this works
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", nil]]

  def edit
    @list = List.find(@item.list_id) #this!!
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", nil]]

  def create
    #@item = Item.new(item_params)
    #write a method in model to get foreign key?
    #@items = Item.where(list_id: params[:id])

    #@listId = params[:list_id]
    #:list_id = params[:list_id]

    #@list = List.find(@item.list_id)

    #@item = @list.Item.new(item_params)

    @item = Item.new(item_params)

    @item.list_id = @@listId #holy shit it worked

    #@item.list_id = @listId

    #@item = Item.new(:item, :name, :quantity, :list_id)

    respond_to do |format|
      if @item.save
        #@item.list_id = @listId
        #@item.save
        format.html { redirect_to List.find(@item.list_id), notice: 'Item was successfully created.' }
---
INSERT INTO "items" ("name", "quantity", "list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "bom bom boom"], ["quantity", 1], ["list_id", 1], ["created_at", "2016-04-04 20:15:30.869274"], ["updated_at", "2016-04-04 20:15:30.869274"]]
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", nil]]

  def update
    respond_to do |format|
      if @item.update(params.require(:item).permit(:name, :quantity))
        format.html { redirect_to List.find(@item.list_id), notice: 'Item was successfully updated.' }
---
UPDATE "items" SET "list_id" = ?, "quantity" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["list_id", nil], ["quantity", 2], ["updated_at", "2016-04-04 04:43:03.018646"], ["id", 2]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 2]]