app/controllers/lists_controller.rb

SELECT "items".* FROM "items" WHERE "items"."list_id" = ?  [["list_id", 1]]
---
  def show
    @items = Item.where(list_id: params[:id])

INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Hardware"], ["created_at", "2016-04-02 20:03:13.179846"], ["updated_at", "2016-04-02 20:03:13.179846"]]
---
  def create
    @list = List.new(list_params)

    respond_to do |format|
      if @list.save

UPDATE "lists" SET "name" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["name", "Groceries1"], ["updated_at", "2016-04-04 01:34:36.964913"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @list.update(list_params)

SELECT "items".* FROM "items" WHERE "items"."list_id" = ?  [["list_id", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 3]]
---
  def destroy
    #@item.where(list_id: params[:id]).destroy_all

    @items = Item.where(list_id: params[:id])
    @items.each do |item|
      item.destroy
    end
    @list.destroy